{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "7db8defe",
   "metadata": {},
   "source": [
    "## Graph RAG with Neo4j and Langchain"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "afb3b545",
   "metadata": {},
   "source": [
    "### Import libraries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "058562c6",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "0451f1cd",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "c:\\Users\\Kong\\Desktop\\scg\\agentic-graphrag-langchain\\venv\\Lib\\site-packages\\IPython\\core\\interactiveshell.py:3699: LangChainDeprecationWarning: As of langchain-core 0.3.0, LangChain uses pydantic v2 internally. The langchain_core.pydantic_v1 module was a compatibility shim for pydantic v1, and should no longer be used. Please update the code to import from Pydantic directly.\n",
      "\n",
      "For example, replace imports like: `from langchain_core.pydantic_v1 import BaseModel`\n",
      "with: `from pydantic import BaseModel`\n",
      "or the v1 compatibility namespace if you are working in a code base that has not been fully upgraded to pydantic 2 yet. \tfrom pydantic.v1 import BaseModel\n",
      "\n",
      "  exec(code_obj, self.user_global_ns, self.user_ns)\n"
     ]
    }
   ],
   "source": [
    "from langchain_core.runnables import RunnablePassthrough\n",
    "from langchain_core.prompts import ChatPromptTemplate\n",
    "from langchain_core.pydantic_v1 import BaseModel, Field\n",
    "from langchain_core.output_parsers import StrOutputParser\n",
    "from langchain_neo4j import Neo4jGraph, GraphCypherQAChain\n",
    "from langchain.text_splitter import RecursiveCharacterTextSplitter\n",
    "from langchain_google_genai import ChatGoogleGenerativeAI\n",
    "from langchain_ollama import ChatOllama\n",
    "from langchain_experimental.graph_transformers import LLMGraphTransformer\n",
    "from neo4j import GraphDatabase\n",
    "from yfiles_jupyter_graphs import GraphWidget\n",
    "from langchain_community.vectorstores import Neo4jVector\n",
    "from langchain_ollama import OllamaEmbeddings\n",
    "from langchain_community.document_loaders import TextLoader\n",
    "from langchain_community.vectorstores.neo4j_vector import remove_lucene_chars"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2e5f73d2",
   "metadata": {},
   "source": [
    "### Load Environment Variables and Set Constants"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0a2430ee",
   "metadata": {},
   "outputs": [],
   "source": [
    "load_dotenv()\n",
    "\n",
    "# Constants\n",
    "GEMINI_API_KEY = os.getenv(\"GEMINI_API_KEY\")\n",
    "NEO4J_URI = os.getenv(\"NEO4J_URI\")\n",
    "NEO4J_USERNAME = os.getenv(\"NEO4J_USERNAME\")\n",
    "NEO4J_PASSWORD = os.getenv(\"NEO4J_PASSWORD\")\n",
    "LLM_TYPE = os.getenv(\"LLM_TYPE\", \"ollama\")  # Default to 'ollama' if not set\n",
    "OLLAMA_MODEL = os.getenv(\"OLLAMA_MODEL\", \"llama3.1\")  # Default to 'llama3.1' if not set\n",
    "\n",
    "os.environ[\"GOOGLE_API_KEY\"] = GEMINI_API_KEY"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "4131c9c8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Using LLM type: ollama\n"
     ]
    }
   ],
   "source": [
    "print(f\"Using LLM type: {LLM_TYPE}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "884bdb17",
   "metadata": {},
   "source": [
    "### Establish Connection to Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "6b8522e2",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Neo4jGraph(\n",
    "  url=NEO4J_URI,\n",
    "  username=NEO4J_USERNAME,\n",
    "  password=NEO4J_PASSWORD,\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "21ad03b4",
   "metadata": {},
   "source": [
    "### Load Documents and Chunking"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8c8113c7",
   "metadata": {},
   "source": [
    "Set the path to the document to add to the Knowledge Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "acc0ff6b",
   "metadata": {},
   "outputs": [],
   "source": [
    "file_path = \"docs/tas_1.txt\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ae1c337a",
   "metadata": {},
   "source": [
    "Load the document to be added"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2e2aa934",
   "metadata": {},
   "outputs": [],
   "source": [
    "loader = TextLoader(\n",
    "  file_path=file_path,\n",
    "  encoding=\"utf-8\",\n",
    ")\n",
    "docs = loader.load()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "8d31c60d",
   "metadata": {},
   "outputs": [],
   "source": [
    "text_splitter = RecursiveCharacterTextSplitter(\n",
    "  chunk_size=500,\n",
    "  chunk_overlap=128,\n",
    ")\n",
    "documents = text_splitter.split_documents(docs)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "ee4508b5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "264\n"
     ]
    }
   ],
   "source": [
    "print(len(documents))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "80c588d4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "page_content='หน้า ๑ (เล่มที่ ๑)\\nเล่ม ๑๓๗ ตอนพิเศษ ๒๑๔ ง ราชกิจจานุเบกษา ๑๗ กันยายน ๒๕๖๓\\nประกาศสภาวิชาชีพบัญชี\\nที่ ๒๕/๒๕๖๓\\nเรื่อง มาตรฐานการบัญชี ฉบับที่ ๑\\nเรื่อง การนาเสนองบการเงิน\\nอาศัยอ านาจตามมาตรา ๗ (๓) และมาตรา ๓๔ แห่งพระราชบัญญัติวิชาชีพบัญชี\\nพ.ศ. ๒๕๔๗ ที่ก าหนดให้สภาวิชาชีพบัญชีมีอ านาจหน้าที่ในการก าหนดและปรับปรุงมาตรฐานการบัญชี\\nเพื่อใช้เป็นมาตรฐานในการจัดท าบัญชีตามกฎหมายว่าด้วยการบัญชีและกฎหมายอื่น' metadata={'source': 'docs/tas_1.txt'}\n"
     ]
    }
   ],
   "source": [
    "print(documents[0])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c7d4ae52",
   "metadata": {},
   "source": [
    "### Convert Text Chunks into Graphs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "10973684",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Using Ollama LLM\n"
     ]
    },
    {
     "ename": "",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31mThe Kernel crashed while executing code in the current cell or a previous cell. \n",
      "\u001b[1;31mPlease review the code in the cell(s) to identify a possible cause of the failure. \n",
      "\u001b[1;31mClick <a href='https://aka.ms/vscodeJupyterKernelCrash'>here</a> for more info. \n",
      "\u001b[1;31mView Jupyter <a href='command:jupyter.viewOutput'>log</a> for further details."
     ]
    }
   ],
   "source": [
    "if LLM_TYPE == \"ollama\":\n",
    "  print(\"Using Ollama LLM\")\n",
    "  llm = ChatOllama(\n",
    "    model=\"llama3.1\",\n",
    "    temperature=0,\n",
    "  )\n",
    "else:\n",
    "  print(\"Using Google Gemini LLM\")\n",
    "  llm = ChatGoogleGenerativeAI(\n",
    "    model=\"gemini-2.0-flash-lite\",\n",
    "    temperature=0,\n",
    "  )\n",
    "llm_transformer = LLMGraphTransformer(llm)\n",
    "\n",
    "graph_documents = llm_transformer.convert_to_graph_documents(documents)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5b0c2a02",
   "metadata": {},
   "source": [
    "### Add Graphs into Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "4f7922af",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.add_graph_documents(\n",
    "  graph_documents=graph_documents,\n",
    "  include_source=True,\n",
    "  baseEntityLabel=True,\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5328062f",
   "metadata": {},
   "source": [
    "### Compute Vector Embeddings from Graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "9598346c",
   "metadata": {},
   "outputs": [],
   "source": [
    "embeddings = OllamaEmbeddings(\n",
    "  model=\"qllama/multilingual-e5-small\"\n",
    ")\n",
    "\n",
    "vector_index = Neo4jVector.from_existing_graph(\n",
    "  embedding=embeddings,\n",
    "  search_type=\"hybrid\",\n",
    "  node_label=\"Document\",\n",
    "  text_node_properties=[\"text\"],\n",
    "  embedding_node_property=\"embedding\",\n",
    ")\n",
    "\n",
    "vector_retriever = vector_index.as_retriever()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a8f6d247",
   "metadata": {},
   "source": [
    "### Chain for Extracting Entities"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "52efd947",
   "metadata": {},
   "outputs": [],
   "source": [
    "llm = ChatGoogleGenerativeAI(\n",
    "  model=\"gemini-2.0-flash\",\n",
    "  temperature=0,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "749823ee",
   "metadata": {},
   "outputs": [],
   "source": [
    "class Entities(BaseModel):\n",
    "  \"\"\"Identifying informatoin about entities\"\"\"\n",
    "\n",
    "  names: list[str] = Field(\n",
    "    ...,\n",
    "    description=\"All the person, organization, or business entities that appears in the text\",\n",
    "  )\n",
    "\n",
    "prompt = ChatPromptTemplate.from_messages(\n",
    "  [\n",
    "    (\n",
    "      \"system\",\n",
    "      \"You are extracting organization and person entities from the text\"\n",
    "    ),\n",
    "    (\n",
    "      \"human\",\n",
    "      \"Use the given format to extract information from the following \"\n",
    "      \"input: {question}\",\n",
    "    )\n",
    "  ]\n",
    ")\n",
    "\n",
    "entity_chain = prompt | llm.with_structured_output(Entities)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "09f08dc8",
   "metadata": {},
   "source": [
    "### Retrieval from Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "53c94253",
   "metadata": {},
   "source": [
    "#### Check Entities Extraction"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "c57bf553",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['ภาษีมูลค่าเพิ่ม']"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "entity_chain.invoke({\"question\": \"ภาษีมูลค่าเพิ่ม\"}).names"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e3ccb843",
   "metadata": {},
   "source": [
    "#### Query the Graph Database"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f38d10d6",
   "metadata": {},
   "source": [
    "First, create a full text index for the field ID by running the cypher query:\n",
    "\n",
    "`CREATE FULLTEXT INDEX entity FOR (n:__Entity__) ON EACH [n.id]`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "204cf44d",
   "metadata": {},
   "outputs": [],
   "source": [
    "def generate_full_text_query(input: str) -> str:\n",
    "  words = [el for el in remove_lucene_chars(input).split() if el]\n",
    "  if not words:\n",
    "    return \"\"\n",
    "  full_text_query = \" AND \".join([f\"{word}~2\" for word in words])\n",
    "  print(f\"Generated Query: {full_text_query}\")\n",
    "  return full_text_query.strip()\n",
    "\n",
    "# Fulltext index query\n",
    "def graph_retriever(question: str) -> str:\n",
    "  \"\"\"\n",
    "  Collects the neighborhood of entities mentioned\n",
    "  in the question\n",
    "  \"\"\"\n",
    "  result = \"\"\n",
    "  entities = entity_chain.invoke({\"question\": question})\n",
    "  for entity in entities.names:\n",
    "    response = graph.query(\n",
    "      \"\"\"CALL db.index.fulltext.queryNodes('entity', $query, {limit: 2})\n",
    "      YIELD node, score\n",
    "      CALL {\n",
    "        WITH node\n",
    "        MATCH (node)-[r:!MENTIONS]->(neighbor)\n",
    "        RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\n",
    "        UNION ALL\n",
    "        WITH node\n",
    "        MATCH (node)<-[r:!MENTIONS]-(neighbor)\n",
    "        RETURN neighbor.id + ' - ' + type(r) + ' -> ' + node.id AS output\n",
    "      }\n",
    "      RETURN output LIMIT 10\n",
    "      \"\"\",\n",
    "      {\"query\": entity},\n",
    "    )\n",
    "    result += \"\\n\".join([el['output'] for el in response])\n",
    "  return result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "3473a1b6",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (node, node) { ... }} {position: line: 3, column: 7, offset: 94} for query: \"CALL db.index.fulltext.queryNodes('entity', $query, {limit: 2})\\n      YIELD node, score\\n      CALL {\\n        WITH node\\n        MATCH (node)-[r:!MENTIONS]->(neighbor)\\n        RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\\n        UNION ALL\\n        WITH node\\n        MATCH (node)<-[r:!MENTIONS]-(neighbor)\\n        RETURN neighbor.id + ' - ' + type(r) + ' -> ' + node.id AS output\\n      }\\n      RETURN output LIMIT 10\\n      \"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "ผู้ประกอบการ - SERVICE_PROVIDER -> ราชอาณาจักร\n",
      "มาตรา 83/6 - APPLICABLE_IN -> ราชอาณาจักร\n"
     ]
    }
   ],
   "source": [
    "print(graph_retriever(\"ราชอาณาจักร\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c4ba7c32",
   "metadata": {},
   "source": [
    "#### Full Retriever to Retrieve from Vector Store"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "5de1b4d0",
   "metadata": {},
   "outputs": [],
   "source": [
    "def full_retriever(question: str):\n",
    "  graph_data = graph_retriever(question)\n",
    "  vector_data = [el.page_content for el in vector_retriever.invoke(question)]\n",
    "  final_data = f\"\"\"Graph data:\n",
    "  {graph_data}\n",
    "  vector data:\n",
    "  {\"#Document \".join(vector_data)}\n",
    "  \"\"\"\n",
    "  return final_data"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fdd5ff21",
   "metadata": {},
   "source": [
    "### Final Chain"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "baf2a9d2",
   "metadata": {},
   "outputs": [],
   "source": [
    "template = \"\"\"Answer the qyestion based only on the following context:\n",
    "{context}\n",
    "\n",
    "Question: {question}\n",
    "Use natural language and be concise.\n",
    "Answer:\"\"\"\n",
    "\n",
    "prompt = ChatPromptTemplate.from_template(template)\n",
    "\n",
    "chain = (\n",
    "  {\n",
    "    \"context\": full_retriever,\n",
    "    \"question\": RunnablePassthrough()\n",
    "  }\n",
    "  | prompt\n",
    "  | llm \n",
    "  | StrOutputParser()\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "65bc0598",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (node, node) { ... }} {position: line: 3, column: 7, offset: 94} for query: \"CALL db.index.fulltext.queryNodes('entity', $query, {limit: 2})\\n      YIELD node, score\\n      CALL {\\n        WITH node\\n        MATCH (node)-[r:!MENTIONS]->(neighbor)\\n        RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\\n        UNION ALL\\n        WITH node\\n        MATCH (node)<-[r:!MENTIONS]-(neighbor)\\n        RETURN neighbor.id + ' - ' + type(r) + ' -> ' + node.id AS output\\n      }\\n      RETURN output LIMIT 10\\n      \"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL () { ... }} {position: line: 1, column: 1, offset: 0} for query: \"CALL { CALL db.index.vector.queryNodes($index, $k, $embedding) YIELD node, score WITH collect({node:node, score:score}) AS nodes, max(score) AS max UNWIND nodes AS n RETURN n.node AS node, (n.score / max) AS score UNION CALL db.index.fulltext.queryNodes($keyword_index, $query, {limit: $k}) YIELD node, score WITH collect({node:node, score:score}) AS nodes, max(score) AS max UNWIND nodes AS n RETURN n.node AS node, (n.score / max) AS score } WITH node, max(score) AS score ORDER BY score DESC LIMIT $k RETURN reduce(str='', k IN ['text'] | str + '\\\\n' + k + ': ' + coalesce(node[k], '')) AS text, node {.*, `embedding`: Null, id: Null, `text`: Null} AS metadata, score\"\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'ไม่มีข้อมูลเกี่ยวกับการจ่ายภาษีสินค้าต่างประเทศในข้อความที่ให้มา'"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain.invoke(input=\"การจ่ายภาษีสินค้าต่างประเทศ\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
