{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "55eefe41",
   "metadata": {},
   "source": [
    "## Query the Knowledge Graph"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e78b611a",
   "metadata": {},
   "source": [
    "### Import Libraries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "62c7a309",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "23c158b0",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_core.runnables import RunnablePassthrough\n",
    "from langchain_core.prompts import ChatPromptTemplate\n",
    "from langchain_core.pydantic_v1 import BaseModel, Field\n",
    "from langchain_core.output_parsers import StrOutputParser\n",
    "from langchain_neo4j import Neo4jGraph, GraphCypherQAChain\n",
    "from langchain.text_splitter import RecursiveCharacterTextSplitter\n",
    "from langchain_google_genai import ChatGoogleGenerativeAI\n",
    "from langchain_ollama import ChatOllama\n",
    "from langchain_experimental.graph_transformers import LLMGraphTransformer\n",
    "from neo4j import GraphDatabase\n",
    "from yfiles_jupyter_graphs import GraphWidget\n",
    "from langchain_community.vectorstores import Neo4jVector\n",
    "from langchain_ollama import OllamaEmbeddings\n",
    "from langchain_community.document_loaders import TextLoader\n",
    "from langchain_community.vectorstores.neo4j_vector import remove_lucene_chars"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0a6aaad1",
   "metadata": {},
   "source": [
    "### Load Environment Variables and Set Constants"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "e0b688aa",
   "metadata": {},
   "outputs": [],
   "source": [
    "load_dotenv()\n",
    "\n",
    "# Constants\n",
    "GEMINI_API_KEY = os.getenv(\"GEMINI_API_KEY\")\n",
    "NEO4J_URI = os.getenv(\"NEO4J_URI\")\n",
    "NEO4J_USERNAME = os.getenv(\"NEO4J_USERNAME\")\n",
    "NEO4J_PASSWORD = os.getenv(\"NEO4J_PASSWORD\")\n",
    "LLM_TYPE = os.getenv(\"LLM_TYPE\", \"ollama\")  # Default to 'ollama' if not set\n",
    "OLLAMA_MODEL = os.getenv(\"OLLAMA_MODEL\", \"llama3.1\")  # Default to 'llama3.1' if not set\n",
    "\n",
    "os.environ[\"GOOGLE_API_KEY\"] = GEMINI_API_KEY"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "2ffbafdb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Using LLM type: google\n"
     ]
    }
   ],
   "source": [
    "print(f\"Using LLM type: {LLM_TYPE}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "46b1deac",
   "metadata": {},
   "source": [
    "### Establish Connection to Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "a385e03e",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Neo4jGraph(\n",
    "  url=NEO4J_URI,\n",
    "  username=NEO4J_USERNAME,\n",
    "  password=NEO4J_PASSWORD,\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "404b7aeb",
   "metadata": {},
   "source": [
    "### Chain for Extracting Entities"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "f4dc02bc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Using Google Gemini LLM\n"
     ]
    }
   ],
   "source": [
    "if LLM_TYPE == \"ollama\":\n",
    "  print(\"Using Ollama LLM\")\n",
    "  llm = ChatOllama(\n",
    "    model=\"llama3.1\",\n",
    "    temperature=0,\n",
    "  )\n",
    "else:\n",
    "  print(\"Using Google Gemini LLM\")\n",
    "  llm = ChatGoogleGenerativeAI(\n",
    "    model=\"gemini-2.0-flash-lite\",\n",
    "    temperature=0,\n",
    "  )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "8be34d95",
   "metadata": {},
   "outputs": [],
   "source": [
    "class Entities(BaseModel):\n",
    "  \"\"\"Identifying informatoin about entities\"\"\"\n",
    "\n",
    "  names: list[str] = Field(\n",
    "    ...,\n",
    "    description=\"All the person, organization, or business entities that appears in the text\",\n",
    "  )\n",
    "\n",
    "prompt = ChatPromptTemplate.from_messages(\n",
    "  [\n",
    "    (\n",
    "      \"system\",\n",
    "      \"You are extracting organization and person entities from the text\"\n",
    "    ),\n",
    "    (\n",
    "      \"human\",\n",
    "      \"Use the given format to extract information from the following \"\n",
    "      \"input: {question}\",\n",
    "    )\n",
    "  ]\n",
    ")\n",
    "\n",
    "entity_chain = prompt | llm.with_structured_output(Entities)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "62b5a5aa",
   "metadata": {},
   "source": [
    "### Query the Graph Database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "9034c72d",
   "metadata": {},
   "outputs": [],
   "source": [
    "def generate_full_text_query(input: str) -> str:\n",
    "  words = [el for el in remove_lucene_chars(input).split() if el]\n",
    "  if not words:\n",
    "    return \"\"\n",
    "  full_text_query = \" AND \".join([f\"{word}~2\" for word in words])\n",
    "  print(f\"Generated Query: {full_text_query}\")\n",
    "  return full_text_query.strip()\n",
    "\n",
    "# Fulltext index query\n",
    "def graph_retriever(question: str) -> str:\n",
    "  \"\"\"\n",
    "  Collects the neighborhood of entities mentioned\n",
    "  in the question\n",
    "  \"\"\"\n",
    "  result = \"\"\n",
    "  entities = entity_chain.invoke({\"question\": question})\n",
    "  print(entities)\n",
    "  for entity in entities.names:\n",
    "    response = graph.query(\n",
    "      \"\"\"CALL db.index.fulltext.queryNodes('entity', $query, {limit: 2})\n",
    "      YIELD node, score\n",
    "      CALL {\n",
    "        WITH node\n",
    "        MATCH (node)-[r:!MENTIONS]->(neighbor)\n",
    "        RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\n",
    "        UNION ALL\n",
    "        WITH node\n",
    "        MATCH (node)<-[r:!MENTIONS]-(neighbor)\n",
    "        RETURN neighbor.id + ' - ' + type(r) + ' -> ' + node.id AS output\n",
    "      }\n",
    "      RETURN output LIMIT 20\n",
    "      \"\"\",\n",
    "      {\"query\": entity},\n",
    "    )\n",
    "    result += \"\\n\".join([el['output'] for el in response])\n",
    "  return result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "cc7aff7e",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (node, node) { ... }} {position: line: 3, column: 7, offset: 94} for query: \"CALL db.index.fulltext.queryNodes('entity', $query, {limit: 2})\\n      YIELD node, score\\n      CALL {\\n        WITH node\\n        MATCH (node)-[r:!MENTIONS]->(neighbor)\\n        RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\\n        UNION ALL\\n        WITH node\\n        MATCH (node)<-[r:!MENTIONS]-(neighbor)\\n        RETURN neighbor.id + ' - ' + type(r) + ' -> ' + node.id AS output\\n      }\\n      RETURN output LIMIT 20\\n      \"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "names=['ภาษีเงินได้']\n",
      "ภาษีเงินได้ - RELATED_TO -> ภาษี\n",
      "ภาษีเงินได้ - RELATED_TO -> มาตรฐานการบัญชี\n",
      "ภาษีเงินได้ - RELATED_TO -> หนี้สิน\n",
      "ภาษีเงินได้ - RELATED_TO -> รายได้\n",
      "ภาษีเงินได้ - RELATED_TO -> ค่าใช้จ่าย\n",
      "ภาษีเงินได้ - RELATED_TO -> บริษัทใหญ่\n",
      "ภาษีเงินได้ - RELATED_TO -> การลงทุน\n",
      "ภาษีเงินได้ - RELATED_TO -> งวดปัจจุบัน\n",
      "ภาษีเงินได้ - RELATED_TO -> สินทรัพย์ภาษีเงินได้\n",
      "ภาษีเงินได้ - RELATED_TO -> การตัดบัญชี\n",
      "ภาษีเงินได้ - RELATED_TO -> เกณฑ์เงินสด\n",
      "ภาษีเงินได้ - RELATED_TO -> งวดที่ผ่านมา\n",
      "ภาษีเงินได้ - RELATED_TO -> หนี้สนิ\n",
      "ภาษีเงินได้ - RELATED_TO -> ผลต่างระหว่างมูลค่า ตามบัญชีของสิน ทรัพย์กับฐานภาษีของสิน ทรัพย์\n",
      "ภาษีเงินได้ - RELATED_TO -> ภาษีเงินได้รอการตัดบัญชี\n",
      "ภาษีเงินได้ - RELATED_TO -> อัตราภาษี\n",
      "ภาษีเงินได้ - RELATED_TO -> ค่าเสื่อมราคาสะสมทางภาษี\n",
      "ภาษีเงินได้ - RELATED_TO -> เสียภาษี\n",
      "ภาษีเงินได้ - RELATED_TO -> กาไรส่วนที่เกินต้นทุน\n",
      "ภาษีเงินได้ - RELATED_TO -> การวัดมูลค่าอสังหาริมทรัพย์\n"
     ]
    }
   ],
   "source": [
    "retrieved = graph_retriever(\"กฎหมายที่เกี่ยวกับภาษีเงินได้มีอะไรบ้าง?\")\n",
    "print(retrieved)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "54187ed3",
   "metadata": {},
   "source": [
    "### Vector Similarity Search"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "69b61bce",
   "metadata": {},
   "outputs": [],
   "source": [
    "embeddings = OllamaEmbeddings(\n",
    "  model=\"qllama/multilingual-e5-small\"\n",
    ")\n",
    "\n",
    "vector_index = Neo4jVector.from_existing_graph(\n",
    "  embedding=embeddings,\n",
    "  search_type=\"hybrid\",\n",
    "  node_label=\"Document\",\n",
    "  text_node_properties=[\"text\"],\n",
    "  embedding_node_property=\"embedding\",\n",
    ")\n",
    "\n",
    "vector_retriever = vector_index.as_retriever()\n",
    "\n",
    "def vector_retrieve(question: str) -> str:\n",
    "  \"\"\"\n",
    "  Using vector similarity to find relevant documents based on the entities\n",
    "  in the question\n",
    "  \"\"\"\n",
    "  result = \"\"\n",
    "  entities = entity_chain.invoke({\"question\": question})\n",
    "  for entity in entities.names:\n",
    "    response = vector_retriever.invoke(entity)\n",
    "    text = \"\\n\".join([el.page_content for el in response])\n",
    "    print(len(text), \"characters retrieved\")\n",
    "    result += text\n",
    "\n",
    "  return result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "2cb67e8f",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL () { ... }} {position: line: 1, column: 1, offset: 0} for query: \"CALL { CALL db.index.vector.queryNodes($index, $k, $embedding) YIELD node, score WITH collect({node:node, score:score}) AS nodes, max(score) AS max UNWIND nodes AS n RETURN n.node AS node, (n.score / max) AS score UNION CALL db.index.fulltext.queryNodes($keyword_index, $query, {limit: $k}) YIELD node, score WITH collect({node:node, score:score}) AS nodes, max(score) AS max UNWIND nodes AS n RETURN n.node AS node, (n.score / max) AS score } WITH node, max(score) AS score ORDER BY score DESC LIMIT $k RETURN reduce(str='', k IN ['text'] | str + '\\\\n' + k + ': ' + coalesce(node[k], '')) AS text, node {.*, `embedding`: Null, id: Null, `text`: Null} AS metadata, score\"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "562 characters retrieved\n",
      "\n",
      "text: 51ค\n",
      "\n",
      "text: กิจการต้องเปิ ดเผยส่วนประกอบที่สาคัญของค่าใช้จ่ายภาษีเงินได้หรือรายได้ภาษีเงินได้แยกกัน\n",
      "ส่วนประกอบของค่าใช้ จ่ายภาษีเงินได้ หรือรายได้ ภาษีเงินได้ อาจประกอบด้ วย\n",
      "80.1 ค่าใช้ จ่าย (หรือรายได้ ) ภาษีเงินได้ ของงวดปัจจุบัน\n",
      "80.2 รายการปรับปรุงภาษีเงินได้ ของงวดก่อนที่ รับรู้ในงวดปัจจุบัน\n",
      "80.3 ค่าใช้ จ่าย (หรือรายได้ ) ภาษีเงินได้ รอการตัดบัญชี ของผลแตกต่างชั่วคราวที่ เกิดขึ้น\n",
      "หรือที่ กลับรายการ\n",
      "80.4 ค่าใช้ จ่าย (หรือรายได้ ) ภาษีเงินได้ รอการตัดบัญชีที่เกี่ ยวข้ องกับการเปลี่ ยนแปลง\n",
      "\n",
      "text: สภาวิชาชีพบัญชี ในพระบรมราชูปถัมภ์\n",
      "\n",
      "text: ขอบเขต\n",
      "2\n",
      "\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "retrieved = vector_retrieve(\"กฎหมายที่เกี่ยวกับภาษีเงินได้มีอะไรบ้าง?\").split(\"\\n\")\n",
    "for el in retrieved:\n",
    "  print(el)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2e7a8877",
   "metadata": {},
   "source": [
    "### Full Retriever"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "ca1a2625",
   "metadata": {},
   "outputs": [],
   "source": [
    "def full_retriever(question: str):\n",
    "  graph_data = graph_retriever(question)\n",
    "  vector_data = vector_retrieve(question) \n",
    "  final_data = f\"\"\"Graph data:\n",
    "  {graph_data}\n",
    "  vector data:\n",
    "  {vector_data}\n",
    "  \"\"\"\n",
    "  return final_data"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e6160812",
   "metadata": {},
   "source": [
    "### Final Chain"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "87b40b90",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_core.runnables import RunnableLambda\n",
    "\n",
    "template = \"\"\"Answer the qyestion based only on the following context:\n",
    "{context}\n",
    "\n",
    "Question: {question}\n",
    "Answer:\"\"\"\n",
    "\n",
    "prompt = ChatPromptTemplate.from_template(template)\n",
    "\n",
    "def debug_inputs(inputs):\n",
    "    context = inputs.get(\"context\", \"\")\n",
    "    contexts = context.split(\"\\n\")\n",
    "    for el in contexts:\n",
    "        print(el.strip())\n",
    "    return inputs\n",
    "\n",
    "debug_node = RunnableLambda(debug_inputs)\n",
    "\n",
    "chain = (\n",
    "  {\n",
    "    \"context\": full_retriever,\n",
    "    \"question\": RunnablePassthrough()\n",
    "  }\n",
    "  | prompt\n",
    "  | llm \n",
    "  | StrOutputParser()\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "22151859",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (node, node) { ... }} {position: line: 3, column: 7, offset: 94} for query: \"CALL db.index.fulltext.queryNodes('entity', $query, {limit: 2})\\n      YIELD node, score\\n      CALL {\\n        WITH node\\n        MATCH (node)-[r:!MENTIONS]->(neighbor)\\n        RETURN node.id + ' - ' + type(r) + ' -> ' + neighbor.id AS output\\n        UNION ALL\\n        WITH node\\n        MATCH (node)<-[r:!MENTIONS]-(neighbor)\\n        RETURN neighbor.id + ' - ' + type(r) + ' -> ' + node.id AS output\\n      }\\n      RETURN output LIMIT 20\\n      \"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "names=['ภาษีเงินได้']\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL () { ... }} {position: line: 1, column: 1, offset: 0} for query: \"CALL { CALL db.index.vector.queryNodes($index, $k, $embedding) YIELD node, score WITH collect({node:node, score:score}) AS nodes, max(score) AS max UNWIND nodes AS n RETURN n.node AS node, (n.score / max) AS score UNION CALL db.index.fulltext.queryNodes($keyword_index, $query, {limit: $k}) YIELD node, score WITH collect({node:node, score:score}) AS nodes, max(score) AS max UNWIND nodes AS n RETURN n.node AS node, (n.score / max) AS score } WITH node, max(score) AS score ORDER BY score DESC LIMIT $k RETURN reduce(str='', k IN ['text'] | str + '\\\\n' + k + ': ' + coalesce(node[k], '')) AS text, node {.*, `embedding`: Null, id: Null, `text`: Null} AS metadata, score\"\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'The provided text does not contain information about laws related to income tax. It only mentions concepts related to income tax such as expenses, income, and accounting standards.'"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain.invoke(input=\"กฎหมายที่เกี่ยวกับภาษีเงินได้มีอะไรบ้าง?\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2037a485",
   "metadata": {},
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
